app/controllers/courses_controller.rb

  def create
    @course = current_teacher.courses.build(course_params)

    if @course.save
---
INSERT INTO "courses" ("description", "name", "teacher_id", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "courses"."id" = ?