app/controllers/enrollments_controller.rb

SELECT  1 AS one FROM "enrollments" WHERE "enrollments"."course_id" = ? AND "enrollments"."student_id" = ? LIMIT 1  [["course_id", 1], ["student_id", 1]]
INSERT INTO "enrollments" ("course_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["student_id", 1], ["created_at", "2015-10-31 23:42:45.812232"], ["updated_at", "2015-10-31 23:42:45.812232"]]
---
  def create
    if @enrollment = Enrollment.where(course_id: @course.id, student_id: current_student.id).exists?
      render json: {}, status: 422
    else
      @enrollment = Enrollment.create(course_id: @course.id, student_id: current_student.id)

SELECT  "courses".* FROM "courses" WHERE "courses"."code" = ? LIMIT 1  [["code", "a5dde46f"]]
---
  def set_course
    @course = Course.find_by(code: params['enrollment']['code'])