app/controllers/quiz_center_controller.rb

  def set_student_assignment
    @assignment = StudentAssignment.find(params[:id])
    unless current_student.enrollments.where(course_id: @assignment.assignment.course_id).any?
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]