app/controllers/quiz_center_controller.rb

  def change_start_status
    if @assignment.started == true
      @assignment.update!(started: false)
---
UPDATE "assignments" SET "started" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["started", "t"], ["updated_at", "2015-10-31 23:42:46.227241"], ["id", 1]]

  def index
    if student_signed_in? # student
      @assessments = current_student.student_assignments.where(completed: false).joins(:assignment).where("assignments.category = ?", "Interactive Assessment" ).all || []
    else # teacher
      @assessments = []
      current_teacher.courses.each do |course|
        @assessments += course.assignments.where(category: "Interactive Assessment").all
---
SELECT "courses".* FROM "courses" WHERE "courses"."teacher_id" = ?  [["teacher_id", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = ? AND "assignments"."category" = ?  [["course_id", 1], ["category", "Interactive Assessment"]]

  def manage
    @students = @assignment.course.students.all
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

  def update
    if @assignment.update(student_assignment_params)
---
UPDATE "student_assignments" SET "response" = ?, "updated_at" = ? WHERE "student_assignments"."id" = ?  [["response", "response!"], ["updated_at", "2015-10-31 23:42:46.476352"], ["id", 1]]

  def set_student_assignment
    @assignment = StudentAssignment.find(params[:id])
---
SELECT  "student_assignments".* FROM "student_assignments" WHERE "student_assignments"."id" = ? LIMIT 1  [["id", 1]]