app/controllers/student_assignments_controller.rb

  def complete
    @student_assignment.completed = true
    @student_assignment.save!
---
UPDATE "student_assignments" SET "completed" = ?, "updated_at" = ? WHERE "student_assignments"."id" = ?  [["completed", "t"], ["updated_at", "2015-10-31 23:42:46.569172"], ["id", 1]]

  def set_student_assignment
    @student_assignment = current_student.student_assignments.find_by(id: params[:id])
---
SELECT  "student_assignments".* FROM "student_assignments" WHERE "student_assignments"."student_id" = ? AND "student_assignments"."id" = ? LIMIT 1  [["student_id", 1], ["id", 1]]