rails/app/controllers/assignments_controller.rb

  def create
    due_date = Time.parse(params['assignment']['due_date'] + "12:00:00 AM")
    validator = AssignmentValidator.check(@course.id, due_date, params['assignment']['category'])

    if validator == 1
      # status code 1 means you can proceed, with no warnings.
      @assignment = Assignment.create(category: params['assignment']['category'],
                                      course_id: @course.id,
                                      description: params['assignment']['description'],
                                      due_date: due_date,
                                      name: params['assignment']['name'])
---
INSERT INTO "assignments" ("category", "course_id", "description", "due_date", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    due_date = Time.parse(assignment_params['due_date'] + "12:00:00 AM")
    if @assignment.update(assignment_params.merge(due_date: due_date))
---
UPDATE "assignments" SET "description" = ?, "due_date" = ?, "name" = ?, "updated_at" = ? WHERE "assignments"."id" = ?

  def destroy
    @assignment = Assignment.find_by(id: params[:assignment_id])
    if @assignment.destroy
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]

  def set_course
    @course = Course.find_by(id: params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]